-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 2021-06-24 12:59:12
-- 服务器版本： 5.7.17-log
-- PHP Version: 7.1.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shumadb2`
--

-- --------------------------------------------------------

--
-- 表的结构 `goods`
--

drop database ashuma;
create database ashuma;
use ashuma;

CREATE TABLE `goods` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(500) NOT NULL,
  `typeid` int(10) UNSIGNED NOT NULL,
  `price` double(8,2) UNSIGNED NOT NULL,
  `total` int(10) UNSIGNED NOT NULL,
  `pic` varchar(32) NOT NULL,
  `note` text,
  `addtime` int(10) UNSIGNED NOT NULL,
  `updatetime` datetime DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `goods`
--

INSERT INTO `goods` (`id`, `name`, `typeid`, `price`, `total`, `pic`, `note`, `addtime`, `updatetime`) VALUES
(1, '华硕(ASUS) 天选 15.6英寸游戏笔记本电脑', 2, 6099.00, 100, '202106240208487714.jpg', '新锐龙 7nm 8核 R7-4800H 8G 512GSSD GTX1650Ti 4G 144Hz', 1624457085, '2021-06-24 02:08:48'),
(2, '华为(HUAWEI)MateBook 13 2020款全面屏轻薄性能笔记本电脑', 2, 5999.00, 100, '202106240210067621.jpg', '十代酷睿(i5 16G 512G MX250 触控屏 多屏协同)银', 1624457116, '2021-06-24 02:10:06'),
(3, '荣耀MagicBook Pro 16.1英寸全面屏轻薄高性能笔记本电脑', 2, 4599.00, 100, '202106240210506015.jpg', '标压锐龙R5 3550H 16G 512G 100%sRGB Win10 银', 1624457154, '2021-06-24 02:10:50'),
(4, '华为(HUAWEI)MateBook X Pro 2020款 13.9英寸超轻薄全面屏笔记本电脑', 2, 9999.00, 100, '202106240211025387.jpg', '十代酷睿i7 16G+512G 独显 3K触控 粉', 1624457209, '2021-06-24 02:11:02'),
(5, 'Apple iPad 平板电脑 2019年新款10.2英寸', 3, 2999.00, 100, '202106240213339035.jpg', '128G WLAN版/iPadOS系统/Retina显示屏/MW792CH/A 金色', 1624457248, '2021-06-24 02:13:33'),
(6, 'Apple iPad Air 3 2019年新款平板电脑 10.5英寸', 3, 3896.00, 100, '202106240213515552.jpg', '64G WLAN版/A12芯片/Retina显示屏/MUUK2CH/A 银色', 1624457295, '2021-06-24 02:13:51'),
(7, 'Apple iPad Pro 11英寸平板电脑 2020年新款', 3, 6299.00, 100, '202106240214029853.jpg', '128G WLAN版/全面屏/A12Z/Face ID/MY232CH/A 深空灰色', 1624457323, '2021-06-24 02:14:02'),
(8, 'Apple Watch Series 5智能手表', 10, 3399.00, 100, '202106240214138447.jpg', 'GPS款 44毫米深空灰色铝金属表壳 黑色运动型表带 MWVF2CH/A', 1624457362, '2021-06-24 02:14:13'),
(9, 'Apple 2020新款 MacBook Air 13.3', 2, 7999.00, 100, '202106240214226790.jpg', 'Retina屏 十代i3 8G 256G SSD 银色 笔记本电脑 轻薄本', 1624457417, '2021-06-24 02:14:22'),
(10, 'Apple 2019款 MacBook Pro 13.3【带触控栏】', 2, 11088.00, 100, '202106240214348773.jpg', '八代i5 8G 256G RP645显卡 深空灰 笔记本电脑', 1624457446, '2021-06-24 02:14:34'),
(11, '索尼（SONY）Alpha 6000L APS-C微单数码相机标准套装', 6, 3599.00, 100, '202106240214516042.jpg', '黑色（约2430万有效像素 E PZ 16-50mm镜头 a6000）', 1624457498, '2021-06-24 02:14:51'),
(12, '索尼（SONY）Alpha 7 II 全画幅微单数码相机', 6, 6999.00, 100, '202106240215026644.jpg', '单机身(约2430万有效像素 1080P录像 wifi直连 a7M2/A72)', 1624457528, '2021-06-24 02:15:02'),
(13, '索尼（SONY）Alpha 7R II 全画幅微单数码相机', 6, 9999.00, 100, '202106240215334836.jpg', '单机身（约4240万有效像素 4K视频 5轴防抖 A7RM2/a7r2）', 1624457554, '2021-06-24 02:15:33'),
(14, '索尼（SONY）Alpha 7 III 全画幅微单数码相机 SEL2470Z蔡司镜头套装', 6, 19299.00, 100, '202106240215421434.jpg', '约2420万有效像素 5轴防抖 a7M3/A73', 1624457587, '2021-06-24 02:15:42'),
(15, '佳能（Canon）EOS 800D 单反相机 单反机身 单反套机', 4, 4999.00, 100, '202106240215518698.jpg', 'EF-S 18-55mm f/4-5.6 IS STM 单反镜头', 1624457806, '2021-06-24 02:15:51'),
(16, '佳能（Canon）EOS 80D 单反相机 单反套机', 4, 8299.00, 100, '202106240216159606.jpg', 'EF-S 18-200mm f/3.5-5.6 IS 单反镜头', 1624457833, '2021-06-24 02:16:15'),
(17, '佳能（Canon）EOS 6D Mark II 6D2 单反相机 单反套机', 4, 14499.00, 100, '202106240216228916.jpg', '全画幅（EF 24-105mm f/4L IS II USM 单反镜头）', 1624457869, '2021-06-24 02:16:22'),
(18, '佳能（Canon）EOS 90D 单反相机 单反套机', 4, 9699.00, 100, '202106240216327313.jpg', 'EF-S 18-200mm f/3.5-5.6 IS 单反镜头', 1624457910, '2021-06-24 02:16:32'),
(19, 'Beats Studio3 Wireless 录音师无线3', 12, 1748.00, 100, '202106240216402027.jpg', '头戴式 蓝牙无线降噪耳机 游戏耳机 - 桀骜黑红（十周年版）', 1624457944, '2021-06-24 02:16:40'),
(20, 'Beats X 蓝牙无线 入耳式耳机', 12, 699.00, 100, '202106240216463488.jpg', '带麦可通话 -桀骜黑红（十周年版）', 1624457970, '2021-06-24 02:16:46'),
(21, 'Beats Powerbeats Pro', 12, 1698.00, 100, '202106240217089345.jpg', '完全无线高性能耳机 真无线蓝牙运动耳机 象牙白', 1624457998, '2021-06-24 02:17:08'),
(22, '联想(Lenovo)拯救者Y7000P 英特尔酷睿i5 15.6英寸游戏笔记本电脑', 2, 7299.00, 100, '202106240217143008.jpg', 'i5-9300HF 16G 1TSSD GTX1660Ti 144Hz 竞技版', 1624458023, '2021-06-24 02:17:14'),
(23, '联想(Lenovo)小新Air14 2020性能版 英特尔酷睿i5 全面屏独显轻薄笔记本电脑', 2, 5499.00, 100, '202106240217212289.jpg', 'i5 16G 512G MX350 100%sRGB 银', 1624460510, '2021-06-24 02:17:21'),
(24, '联想(Lenovo)YOGA S740 英特尔酷睿i7 14英寸超轻薄商务办公笔记本电脑', 2, 6899.00, 100, '202106240217331767.jpg', 'i7 16G 512G MX250独显 雷电3接口 灰', 1624460550, '2021-06-24 02:17:33'),
(25, '联想(Lenovo)小新15 2020英特尔酷睿i7 15.6英寸全面屏独显轻薄笔记本电脑', 2, 6499.00, 100, '202106240217502933.jpg', '十代i7 16G 512G MX350高色域 银', 1624460641, '2021-06-24 02:17:50'),
(26, '联想(Lenovo)小新Pro13 2020 英特尔酷睿i5高性能轻薄独显笔记本电脑', 2, 6299.00, 100, '202106240217564623.jpg', 'i5 16G 512G MX350 100%sRGB  沧海冰蓝', 1624460663, '2021-06-24 02:17:56'),
(27, '联想(Lenovo)小新Pro13锐龙版 性能网课办公轻薄笔记本电脑', 2, 4999.00, 100, '202106240218041159.jpg', '标压R5-3550H 16G 512G 人脸识别 100%sRGB 银', 1624460688, '2021-06-24 02:18:04'),
(28, '联想ThinkPad E14 十代英特尔酷睿i5/i7 14英寸商务办公轻薄笔记本电脑', 2, 6799.00, 100, '202106240218094303.jpg', '十代i7 8G 512GSSD 独显 2LCD', 1624460715, '2021-06-24 02:18:09'),
(29, '联想ThinkBook 14英特尔酷睿i5 14英寸轻薄笔记本电脑', 2, 4999.00, 100, '202106240218156255.jpg', '十代酷睿i5 8G 512G傲腾增强型SSD 2G独显', 1624460737, '2021-06-24 02:18:15'),
(30, 'Ins 15 35Work BtCIns 15 3580 20Q11W Microsoft 无Office', 7, 2983.00, 100, '202106240218265821.jpg', 'Celeron 4205U, 1TB HDD, 4GB', 1624460809, '2021-06-24 02:18:26'),
(31, 'XPS 7390XPS 13 7390 20Q31', 2, 10437.00, 100, '202106240218441723.jpg', 'Core-i5, 256GB SSD, 8GB', 1624461980, '2021-06-24 02:18:44'),
(32, 'Ins 14 5490Ins 14 5490 20Q31S 1', 2, 5017.00, 100, '202106240218572002.jpg', 'Core i5, 256GB SSD, 8GB', 1624462124, '2021-06-24 02:18:57'),
(33, 'Dell G5 15 5000 15.6 Inch FHD IPS Gaming Laptop - ( Black)', 2, 7686.00, 100, '202106240219086145.jpg', 'Intel Core i5-9300H, 8 GB RAM, 128 GB SSD + 1TB HDD', 1624462152, '2021-06-24 02:19:08'),
(34, 'Ins 13 5391Ins 13 5391 20Q32S', 2, 5704.00, 100, '202106240219173433.jpg', 'Core i5, 256GB SSD, 8GB', 1624462180, '2021-06-24 02:19:17'),
(35, 'Dell Inspiron 15 3567 FHD 笔记本电脑3585-4610', 2, 3724.00, 100, '202106240219339558.jpg', 'AMD Ryzen 5-2500U, 8 GB RAM 15.6 Inch', 1624462205, '2021-06-24 02:19:33'),
(36, 'Dell Inspiron 15 防眩光 LED 背光2019 笔记本电脑', 2, 2236.00, 100, '202106240219497373.jpg', 'J5MHN Intel Pentium Silver N5000, 4 GB 14.0 Inch', 1624462228, '2021-06-24 02:19:49'),
(37, 'Dell Inspiron 3000 3185 11.6 英寸笔记本电脑 PC', 2, 3805.00, 100, '202106240219578624.jpg', 'AMD A6-9220e，4GB 内存，32GB EMMC 存储，灰色，Windows 10', 1624462250, '2021-06-24 02:19:57'),
(38, 'G7 17 7790Dell G7 17 7790 20Q23 3', 2, 11601.00, 100, '202106240220046149.jpg', 'Core i7, RTX2060, 256GB+1TB, 16GB', 1624462287, '2021-06-24 02:20:04'),
(39, 'Dell Inspiron 15 防眩光 LED 背光 2019 笔记本电脑Dell Inspiron 14 3493', 2, 4079.00, 100, '202106240220156520.jpg', 'Intel i5, 8 GB RAM 14 Inch', 1624462329, '2021-06-24 02:20:15'),
(40, 'Dell Inspiron 5000 Full HD 笔记本电脑', 2, 7710.00, 100, '202106240220224652.jpg', 'Intel Core i7-10510U, 8 GB RAM 14 Inch', 1624462355, '2021-06-24 02:20:22'),
(41, '戴尔Dell游戏笔记本电脑G7', 2, 11055.00, 100, '202106240220358500.jpg', 'Core i7, GTX1660Ti, 256GB+1TB, 16GB', 1624462387, '2021-06-24 02:20:35'),
(42, 'Dell 笔记本电脑 Inspiron 15 5575Ins 15 5575 19Q33B Microsoft Office', 2, 8145.00, 100, '202106240220422164.jpg', 'AMD Ryzen 7, SSD512GB, 16GB', 1624462411, '2021-06-24 02:20:42'),
(43, 'Dell Inspiron 15 防眩光 LED 背光 2019 笔记本电脑', 2, 2599.00, 100, '202106240220492286.jpg', 'Dell Inspiron 14 3493 Intel i3, 4 GB RAM 14 Inch', 1624462441, '2021-06-24 02:20:49'),
(44, 'Ins 13 5391Ins 13 5391 20Q31S 1', 2, 4782.00, 100, '202106240220558861.jpg', 'Core i3, 128GB SSD, 4GB', 1624462466, '2021-06-24 02:20:55'),
(45, 'Ins 13 5391Ins 13 5391 20Q33S 4', 2, 7609.00, 100, '202106240221022546.jpg', 'Core i7, 512GB SSD, 8GB, MX250', 1624462488, '2021-06-24 02:21:02'),
(46, 'HP 笔记本电脑14-cm0042na A4', 2, 2006.00, 100, '202106240221234247.jpg', '4 GB RAM, 64 GB eMMC 14 Inch', 1624462514, '2021-06-24 02:21:23'),
(47, 'HP 惠普 17-by3235ng ( 17.3 英寸 / 高清 ) 笔记本电脑', 2, 3626.00, 100, '202106240221321800.jpg', '英特尔酷睿 i3-1005G1 双 , 8GB DDR4 内存 , 512GB 固态硬盘 , 英特尔超高清显卡 G，Windows 10 ) 银色', 1624462546, '2021-06-24 02:21:32'),
(48, 'HP Pavilion 15.6英寸FHD IPS触摸屏WLED背光笔记本电脑', 2, 6289.00, 100, '202106240221393435.jpg', '英特尔四核i7-1065G7高达3.9GHz，12GB DDR4，1TB硬盘，背光键盘，网络摄像头，Windows 10带配件包15 1TB HDD', 1624462570, '2021-06-24 02:21:39'),
(49, 'HP 惠普 Chromebook ( 12 英寸 / HD+ 触摸屏) 可转换笔记本电脑', 2, 2485.00, 100, '202106240221449396.jpg', '银色12b-ca0000ng 12 Zoll HD+', 1624462596, '2021-06-24 02:21:44'),
(50, 'HP 惠普 Pavilion （14 英寸 / 全高清）笔记本电脑', 2, 3905.00, 100, '202106240221522286.jpg', '银色，指纹传感器14-ce3010ng Intel UHD Grafik mit Fingerabdrucksensor 256GB SSD + 16GB Intel Optane', 1624462675, '2021-06-24 02:21:52'),
(51, '全新 2020 HP 15.6 英寸高清触摸屏笔记本电脑', 2, 6156.00, 100, '202106240222043515.jpg', '英特尔酷睿 i7-1065G7 8GB DDR4 RAM 512GB SSD HDMI 802.11b/g/n/ac Windows 10 银色 15-dy1771ms', 1624462715, '2021-06-24 02:22:04'),
(52, 'HP X360 2019 Gemcut 笔记本电脑', 2, 10781.00, 100, '202106240222123511.jpg', 'i7，16 GB RAM，512GB SSD，Windows 10，HDMI，USB C，触摸屏，B&O 扬声器，3 年 Mcafee 互联网*13TGEMCUT 1TB SSD | 16GB RAM | WINPRO', 1624462744, '2021-06-24 02:22:12'),
(53, 'HP 惠普 Envy 17-cg0278ng 白色笔记本电脑', 2, 10424.00, 100, '202106240222229847.jpg', '43.9厘米（17.3英寸）3840 x 2160 像素 英特尔® 酷睿TM i7 16 GB DDR4-SDRAM 1000 GB SSD NVIDIA GeForce MX330 Wi-Fi 6（802.11ax）Win 10 H', 1624462771, '2021-06-24 02:22:22'),
(54, 'HP 惠普 Envy 17-cg0004ng 银色笔记本电脑', 2, 8486.00, 100, '202106240222275923.jpg', '43.9厘米（17.3英寸）1920 x 1080 像素 英特尔®酷睿TM i7 16 GB DDR4-SDRAM 512 GB SSD NVIDIA GeForce MX330 Wi-Fi 6（802.11ax）Win 10 H', 1624462804, '2021-06-24 02:22:27'),
(55, 'HP 惠普 EliteBook x360', 2, 11222.00, 100, '202106240222331959.jpg', '1040 G5 Intel i7-8550U 35.6 厘米 14\" FHD BV UWVA AG 16GB 512GB/SSD UMA W10P', 1624462830, '2021-06-24 02:22:33'),
(56, 'HP 惠普 250 G7 (15.6 英寸 / HD) 商务笔记本电脑', 2, 2796.00, 100, '202106240222461649.jpg', '（英特尔奔腾 4417U，8 GB DDR4 内存，512 GB SDD，英特尔高清显卡，DVD刻录机，Windows 10 家庭版）银色', 1624462863, '2021-06-24 02:22:46'),
(57, 'HP 惠普 250 G7（15.6英寸 / FHD）商务笔记本电脑', 2, 3122.00, 100, '202106240222517102.jpg', '英特尔酷睿i38130U，8GB DDR4 内存，128GB SDD，1TB 硬盘，英特尔高清显卡，DVD刻录机，Windows 10家庭版）', 1624462884, '2021-06-24 02:22:51'),
(58, 'HP 惠普 14s-dq1014ns 14 英寸 FHD 笔记本电脑', 2, 3870.00, 100, '202106240222591404.jpg', '英特尔酷睿 i7-1065G7，8 GB 内存，512 GB 固态硬盘，集成显卡，无操作系统） 灰色 – 西班牙 QWERTY 键盘', 1624462909, '2021-06-24 02:22:59'),
(59, 'HP 惠普 Probook 470 G7 ( 17.3 英寸 / FHD ) 商务笔记本电脑', 2, 6552.00, 100, '202106240223077192.jpg', '英特尔酷睿 i7-10510U，16GB DDR4 内存，256GB 固态硬盘，1TB 硬盘，英特尔超高清显卡620，Windows 10 Pro）银色', 1624462933, '2021-06-24 02:23:07'),
(60, 'HP 惠普 Probook 470 G7 ( 17.3 英寸 / FHD ) 商务笔记本电脑', 2, 6093.00, 100, '202106240223132275.jpg', '英特尔i7-10510U , 8GB DDR4 内存 , 512GB 固态硬盘 , 1TB 硬盘 , 英特尔超高清显卡 620，Windows 10 Pro ) 银色', 1624462964, '2021-06-24 02:23:13'),
(61, '华为 HUAWEI nova 7 Pro', 1, 3699.00, 100, '202106240223263748.jpg', '3200万追焦双摄 50倍潜望式变焦四摄 5G SoC芯片 8GB+128GB 7号色全网通5G手机', 1624462985, '2021-06-24 02:23:26'),
(62, '华为 HUAWEI P40', 1, 4188.00, 100, '202106240223321566.jpg', '麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 6GB+128GB亮黑色全网通5G手机', 1624463005, '2021-06-24 02:23:32'),
(63, '华为 HUAWEI P40 Pro', 1, 6488.00, 100, '202106240223387312.jpg', '麒麟990 5G SoC芯片 5000万超感知徕卡四摄 50倍数字变焦 8GB+256GB亮黑色全网通5G手机', 1624463035, '2021-06-24 02:23:38'),
(64, '华为 HUAWEI nova 7 SE 5G', 1, 2399.00, 100, '202106240223459010.jpg', '麒麟820 5G SoC芯片 6400万高清AI四摄 40W超级快充 8GB+128GB 幻夜黑全网通手机', 1624463053, '2021-06-24 02:23:45'),
(65, '华为 HUAWEI Mate 30 5G', 1, 4499.00, 100, '202106240223519093.jpg', '麒麟990 4000万超感光徕卡影像双超级快充8GB+128GB亮黑色5G全网通游戏手机', 1624463072, '2021-06-24 02:23:51'),
(66, '华为 HUAWEI Mate 30 Pro 5G', 1, 5899.00, 100, '202106240224046253.jpg', '麒麟990 OLED环幕屏双4000万徕卡电影四摄8GB+128GB亮黑色5G全网通游戏手机', 1624463091, '2021-06-24 02:24:04'),
(67, '小米10', 1, 4299.00, 100, '202106240224091632.jpg', '双模5G 骁龙865 1亿像素8K电影相机 对称式立体声 8GB+256GB 冰海蓝 拍照智能游戏手机', 1624463115, '2021-06-24 02:24:09'),
(68, 'Redmi K30 Pro 5G先锋', 1, 3399.00, 100, '202106240224156525.jpg', '骁龙865旗舰处理器 弹出式超光感全面屏 索尼6400万高清四摄 4700mAh长续航 33W闪充 8GB+128GB 天际蓝 游戏智能手机 小米 红米', 1624463139, '2021-06-24 02:24:15'),
(69, 'Redmi Note8', 1, 899.00, 100, '202106240224221141.jpg', '4800万全场景四摄 4000mAh长续航 高通骁龙665 18W快充 4GB+64GB 梦幻蓝 游戏手机 小米 红米', 1624463169, '2021-06-24 02:24:22'),
(70, '小米10青春版', 1, 2499.00, 100, '202106240224288681.jpg', '双模5G 骁龙765G 50倍潜望式变焦四摄 8GB+128GB 蓝莓薄荷游戏手机', 1624463198, '2021-06-24 02:24:28'),
(71, '小米10 Pro', 1, 4999.00, 100, '202106240224394400.jpg', '双模5G 骁龙865 1亿像素8K电影相机 50倍变焦 50W快充 8GB+256GB 珍珠白 拍照智能游戏手机', 1624463218, '2021-06-24 02:24:39'),
(72, 'Apple iPhone SE (A2298)', 1, 3899.00, 100, '202106240224452159.jpg', '128GB 黑色 移动联通电信4G手机', 1624463237, '2021-06-24 02:24:45'),
(73, 'Apple iPhone XR (A2108)', 1, 4299.00, 100, '202106240224529427.jpg', '64GB 黄色 移动联通电信4G手机 双卡双待', 1624463256, '2021-06-24 02:24:52'),
(74, 'Apple iPhone XS Max (A2104)', 1, 6599.00, 100, '202106240225067320.jpg', '64GB 银色 移动联通电信4G手机 双卡双待', 1624463275, '2021-06-24 02:25:06'),
(75, 'Apple iPhone 11 (A2223)', 1, 5499.00, 100, '202106240225133421.jpg', '64GB 紫色 移动联通电信4G手机 双卡双待', 1624463299, '2021-06-24 02:25:13'),
(76, 'Apple iPhone 11 Pro (A2217)', 1, 8699.00, 100, '202106240225319945.jpg', '64GB 金色 移动联通电信4G手机 双卡双待', 1624463319, '2021-06-24 02:25:31'),
(77, 'Apple iPhone 11 Pro Max (A2220)', 1, 9599.00, 100, '202106240225384157.jpg', '64GB 深空灰色 移动联通电信4G手机 双卡双待', 1624463338, '2021-06-24 02:25:38'),
(78, '一加 OnePlus 8', 1, 4599.00, 100, '202106240225503715.jpg', '5G旗舰 90Hz高清柔性屏 骁龙865 180g轻薄手感 12GB+256GB 黑镜 超清超广角拍照游戏手机', 1624463358, '2021-06-24 02:25:50'),
(79, '一加 OnePlus 8 Pro', 1, 5999.00, 100, '202106240225578612.jpg', '5G旗舰 2K+120Hz 柔性屏 30W无线闪充 骁龙865 12GB+256GB 青空 超清超广角拍照游戏手机', 1624463382, '2021-06-24 02:25:57'),
(80, '一加 OnePlus 7T', 1, 3199.00, 100, '202106240226034033.jpg', '90Hz流体屏 骁龙855Plus旗舰 4800万超广角三摄  8GB+256GB 冰际蓝 游戏手机', 1624463406, '2021-06-24 02:26:03'),
(81, 'vivo X30 Pro 5G', 1, 3698.00, 100, '202106240226192898.jpg', '秘银 8GB+128GB 双模5G 60倍变焦 50mm专业人像镜头 全网通智慧旗舰手机', 1624463423, '2021-06-24 02:26:19'),
(82, 'vivo S6 5G手机', 1, 2698.00, 100, '202106240226273838.jpg', '8GB+128GB 天鹅湖 前置3200万超清夜景自拍 4500mAh大电池 后置四摄 双模5G全网通手机', 1624463441, '2021-06-24 02:26:27'),
(83, 'vivo NEX 3S', 1, 5298.00, 100, '202106240226364490.jpg', '5G 12GB+256GB 深空流光 骁龙865 无界瀑布屏 6400万超高像素 双模5G全网通手机', 1624463465, '2021-06-24 02:26:36'),
(84, 'vivo iQOO Neo3 5G', 1, 2998.00, 199, '202106240226433973.jpg', '8GB+128GB 夜幕黑 高通骁龙865 144Hz竞速屏 立体双扬 44W闪充 双模5G全网通手机', 1624463482, '2021-06-24 02:26:43'),
(85, 'vivo iQOO 3 5G', 1, 3998.00, 100, '202106240226497422.jpg', '12GB+128GB 驭影黑 高通骁龙865 55W超快闪充 专业电竞游戏体验手机 双模5G全网通手机', 1624463499, '2021-06-24 02:26:49'),
(86, 'OPPO Ace2 8+128', 1, 3999.00, 100, '202106240227079285.jpg', '月岩灰双模5G 185g超薄机身 65W超级闪充 40W无线闪充 90Hz电竞屏高通骁龙865游戏智能手机', 1624463523, '2021-06-24 02:27:07'),
(87, 'OPPO Find X2', 1, 5499.00, 100, '202106240227139287.jpg', '超感官旗舰 3K分辨率 120Hz超感屏 多焦段影像系统 骁龙865 65w闪充 8GB+128GB碧波 双模5G手机', 1624463543, '2021-06-24 02:27:13'),
(88, 'OPPO Reno3 Pro', 1, 3699.00, 100, '202106240227185213.jpg', '双模5G 视频双防抖 90HZ高感曲面屏 7.7mm轻薄机身 8GB+128GB 日出印象 拍照游戏视频手机', 1624463563, '2021-06-24 02:27:18'),
(89, 'OPPO Reno3', 1, 2999.00, 100, '202106240227245534.jpg', '双模5G 6400万超清四摄 视频双防抖 7.96mm纤薄机身 8GB+128GB 蓝色星夜全网通拍照游戏视频手机', 1624463581, '2021-06-24 02:27:24'),
(90, 'OPPO A91', 1, 1799.00, 100, '202106240227295931.jpg', '8GB+128GB 暗夜星辰 4800万超清四摄 VOOC闪充3.0 光感屏幕指纹 全网通4G 全面屏拍照游戏智能手机', 1624463600, '2021-06-24 02:27:29'),
(91, 'OPPO Reno2 Z', 1, 2299.00, 100, '202106240227372174.jpg', '8G+128G 深海夜光 4800万夜拍四摄 VOOC闪充 炫彩升降 全网通4G 全面屏拍照游戏智能手机', 1624463622, '2021-06-24 02:27:37');

-- --------------------------------------------------------

--
-- 表的结构 `tb_order`
--

CREATE TABLE `tb_order` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) DEFAULT NULL,
  `goods_id` int(10) DEFAULT NULL,
  `order_sn` varchar(50) DEFAULT NULL COMMENT '订单号',
  `order_money` float(10,2) DEFAULT NULL COMMENT '订单金额',
  `consignee` varchar(20) DEFAULT NULL COMMENT '收货人',
  `phone` varchar(50) DEFAULT NULL,
  `address` varchar(200) DEFAULT NULL COMMENT '收货地址',
  `createtime` datetime DEFAULT NULL,
  `updatetime` datetime DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tb_order`
--

INSERT INTO `tb_order` (`id`, `user_id`, `goods_id`, `order_sn`, `order_money`, `consignee`, `phone`, `address`, `createtime`, `updatetime`) VALUES
(8, 1, 1, '2021062428096', 6099.00, '2', '23', '22', '2021-06-24 12:23:34', NULL),
(7, 1, 2, '2021062445862', 5999.00, '2', '2', '2', '2021-06-24 11:53:04', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(30) DEFAULT NULL,
  `password` varchar(50) DEFAULT NULL,
  `createtime` datetime DEFAULT NULL,
  `updatetime` datetime DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `password`, `createtime`, `updatetime`) VALUES
(1, 'admin', '96e79218965eb72c92a549dd5a330112', '2021-06-05 10:54:47', NULL),
(2, 'weilai', '96e79218965eb72c92a549dd5a330112', '2021-06-05 11:38:04', NULL),
(3, 'xieweijie', '96e79218965eb72c92a549dd5a330112', '2021-06-08 08:56:00', '2020-06-08 08:56:21'),
(4, 'xuanyuan', '96e79218965eb72c92a549dd5a330112', '2021-06-09 00:35:18', NULL),
(5, 'daironghao', '96e79218965eb72c92a549dd5a330112', '2021-06-09 10:35:18', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `goods`
--
ALTER TABLE `goods`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tb_order`
--
ALTER TABLE `tb_order`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `goods`
--
ALTER TABLE `goods`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=92;
--
-- 使用表AUTO_INCREMENT `tb_order`
--
ALTER TABLE `tb_order`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
